# Reinstallation manifest. Apply with: brew bundle --file=Brewfile

# --- CLI tools ---
brew "bash"
brew "bash-completion@2"
brew "fzf"
brew "htop"
brew "mas"
brew "libpq"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pyenv"
brew "wget"
brew "xz"

# --- JS toolchain ---
brew "eslint"
brew "prettier"

# --- AI coding CLIs ---
cask "claude-code"
cask "codex"

# --- Secrets ---
brew "1password-cli"

# --- Terminals ---
cask "ghostty"
cask "kitty"

# --- Browsers ---
cask "firefox"
cask "chromium", args: { no_quarantine: true }

# --- Productivity / windowing ---
cask "1password"
cask "dropbox"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"

# --- Dev / containers ---
cask "orbstack"

# --- Networking ---
cask "tailscale-app"

# --- Media / drawing ---
cask "monodraw"
cask "vlc"
cask "vimr"

# --- Meetings ---
cask "zoom"

# --- Fonts ---
cask "font-fira-code"

# --- Mac App Store ---
# Requires being signed into the App Store first; `mas` cannot sign you in.
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
