# Reinstallation manifest. Apply with: brew bundle --file=Brewfile

# --- Taps ---
tap "hashicorp/tap"

# --- CLI tools ---
brew "bash"
brew "bash-completion@2"
brew "delta" # nicer git diffs
brew "fzf"
brew "htop"
brew "mas"
brew "libpq"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pspg"
brew "pgcli"
brew "pyenv"
brew "tmux"
brew "wget"
brew "xz"

# Youtube
brew "ffmpeg"
brew "yt-dlp"


# --- Dev ---
cask "orbstack"
brew "hashicorp/tap/terraform"
# --- Terminals ---
cask "ghostty"
cask "kitty"
# --- CLIs
cask "claude-code"
cask "codex"
brew "azure-cli"
brew "doctl"
# --- JS toolchain ---
brew "eslint"
brew "prettier"


# --- AI desktop apps ---
cask "claude"


# --- Browsers ---
cask "firefox"
cask "tor-browser"
cask "ungoogled-chromium" # quarantine stripped post-install in mac.sh

# --- Productivity / windowing ---
cask "1password"
cask "1password-cli"
cask "bitwarden"
cask "dropbox"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"
cask "kitlangton-hex"
cask "monitorcontrol"


# --- Networking ---
cask "tailscale-app"

# --- Media / drawing ---
cask "monodraw"
cask "vlc"
cask "vimr"

# --- Meetings ---
cask "zoom"
cask "slack"
cask "discord"

# --- Fonts ---
cask "font-fira-code"

# --- Mac App Store ---
# Requires being signed into the App Store first; `mas` cannot sign you in.
mas "Xcode", id: 497799835
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435

# iOS apps still unsupported, but if that eventually changes
# https://github.com/mas-cli/mas/issues/321
# mas "amaran", id: 6503329243
mas "amaran Desktop", id: 6590629064
